; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 - counter
	)
  (:init
		(= (value c0) 80)
	(= (value c1) 61)
	(= (value c2) 11)
	(= (value c3) 44)
	(= (value c4) 47)
	(= (value c5) 97)
	(= (value c6) 83)
	(= (value c7) 52)
	(= (value c8) 53)
	(= (value c9) 47)
	(= (value c10) 5)
	(= (value c11) 28)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 5 of 11
2. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 5 of 11
3. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 5 of 11
4. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 5 of 11
5. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 5 of 11
6. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 5 of 11
7. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 11
8. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 11
9. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 11
10. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 5 of 11
11. (decrement c8)
   changed: (value c8) from 53 to 49
   goals met: 4 of 11
12. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 11
13. (decrement_rate c1)
   changed: (rate_value c1) from 1 to 0
   goals met: 4 of 11
14. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 11
15. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 4 of 11
16. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 4 of 11
17. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 4 of 11
18. (increase_rate c0)
   changed: (rate_value c0) from 5 to 6
   goals met: 4 of 11
19. (decrement c0)
   changed: (value c0) from 80 to 74
   goals met: 4 of 11
20. (increase_rate c0)
   changed: (rate_value c0) from 6 to 7
   goals met: 4 of 11
21. (decrement c0)
   changed: (value c0) from 74 to 67
   goals met: 4 of 11
22. (decrement c0)
   changed: (value c0) from 67 to 60
   goals met: 5 of 11
23. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 5 of 11
24. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 5 of 11
25. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 5 of 11
26. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 5 of 11
27. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 5 of 11
28. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 5 of 11
29. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 5 of 11
30. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 5 of 11
31. (increment c8)
   changed: (value c8) from 49 to 53
   goals met: 6 of 11
32. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 6 of 11
33. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 6 of 11
34. (increment c10)
   changed: (value c10) from 5 to 12
   goals met: 6 of 11
35. (increment c10)
   changed: (value c10) from 12 to 19
   goals met: 6 of 11
36. (increment c10)
   changed: (value c10) from 19 to 26
   goals met: 6 of 11
37. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 6 of 11
38. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 6 of 11
39. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 6 of 11
40. (increment c10)
   changed: (value c10) from 26 to 36
   goals met: 5 of 11
41. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 5 of 11
42. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 5 of 11
43. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 5 of 11
44. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 5 of 11
45. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 5 of 11
46. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 5 of 11
47. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 5 of 11
48. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 5 of 11
49. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 5 of 11
50. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 5 of 11
51. (increment c6)
   changed: (value c6) from 83 to 88
   goals met: 5 of 11
52. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 5 of 11
53. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 5 of 11
54. (increment c6)
   changed: (value c6) from 88 to 93
   goals met: 5 of 11
55. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 5 of 11
56. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 5 of 11
57. (increment c6)
   changed: (value c6) from 93 to 98
   goals met: 6 of 11
58. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 6 of 11
59. (increment c7)
   changed: (value c7) from 52 to 61
   goals met: 5 of 11
60. (decrement c6)
   changed: (value c6) from 98 to 92
   goals met: 4 of 11
61. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 4 of 11
62. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 4 of 11
63. (increment c2)
   changed: (value c2) from 11 to 17
   goals met: 4 of 11
64. (increment c2)
   changed: (value c2) from 17 to 23
   goals met: 4 of 11
65. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 4 of 11
66. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 4 of 11
67. (increment c2)
   changed: (value c2) from 23 to 31
   goals met: 4 of 11
68. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 11
69. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 11
70. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 4 of 11
71. (increment c2)
   changed: (value c2) from 31 to 40
   goals met: 4 of 11
72. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 4 of 11
73. (increment c2)
   changed: (value c2) from 40 to 50
   goals met: 3 of 11
74. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 3 of 11
75. (increment c6)
   changed: (value c6) from 92 to 99
   goals met: 4 of 11
76. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 4 of 11
77. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 4 of 11
78. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 4 of 11
79. (decrement c7)
   changed: (value c7) from 61 to 51
   goals met: 5 of 11
80. (decrement c6)
   changed: (value c6) from 99 to 89
   goals met: 4 of 11
81. (increment c9)
   changed: (value c9) from 47 to 50
   goals met: 4 of 11
82. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 4 of 11
83. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 4 of 11
84. (increment c7)
   changed: (value c7) from 51 to 61
   goals met: 3 of 11
85. (increment c6)
   changed: (value c6) from 89 to 99
   goals met: 4 of 11
86. (decrement c8)
   changed: (value c8) from 53 to 49
   goals met: 5 of 11
87. (decrement c2)
   changed: (value c2) from 50 to 40
   goals met: 6 of 11
88. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 6 of 11
89. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 6 of 11
90. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 6 of 11
91. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 6 of 11
92. (decrement c1)
   changed: (value c1) from 61 to 55
   goals met: 5 of 11
93. (decrement c0)
   changed: (value c0) from 60 to 53
   goals met: 6 of 11
94. (increment c2)
   changed: (value c2) from 40 to 50
   goals met: 5 of 11
95. (decrement c1)
   changed: (value c1) from 55 to 49
   goals met: 5 of 11
96. (decrement c0)
   changed: (value c0) from 53 to 46
   goals met: 6 of 11
97. (decrement c2)
   changed: (value c2) from 50 to 40
   goals met: 6 of 11
98. (decrement c1)
   changed: (value c1) from 49 to 43
   goals met: 5 of 11
99. (decrement c1)
   changed: (value c1) from 43 to 37
   goals met: 6 of 11
100. (decrement c0)
   changed: (value c0) from 46 to 39
   goals met: 6 of 11
101. (decrement c0)
   changed: (value c0) from 39 to 32
   goals met: 7 of 11
102. (increment c10)
   changed: (value c10) from 36 to 46
   goals met: 7 of 11
103. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 11
104. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 11
105. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 11
106. (increment c11)
   changed: (value c11) from 28 to 31
   goals met: 7 of 11
107. (increment c11)
   changed: (value c11) from 31 to 34
   goals met: 7 of 11
108. (increment c11)
   changed: (value c11) from 34 to 37
   goals met: 7 of 11
109. (increment c10)
   changed: (value c10) from 46 to 56
   goals met: 8 of 11
110. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 8 of 11
111. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 8 of 11
112. (increment c11)
   changed: (value c11) from 37 to 42
   goals met: 8 of 11
113. (increment c11)
   changed: (value c11) from 42 to 47
   goals met: 8 of 11
114. (increment c11)
   changed: (value c11) from 47 to 52
   goals met: 8 of 11
115. (increment c11)
   changed: (value c11) from 52 to 57
   goals met: 9 of 11
116. (increment c8)
   changed: (value c8) from 49 to 53
   goals met: 8 of 11
117. (increment c9)
   changed: (value c9) from 50 to 55
   goals met: 9 of 11
118. (decrement c7)
   changed: (value c7) from 61 to 51
   goals met: 10 of 11
119. (decrement c6)
   changed: (value c6) from 99 to 89
   goals met: 9 of 11
120. (decrement c6)
   changed: (value c6) from 89 to 79
   goals met: 9 of 11
121. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 9 of 11
122. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 9 of 11
123. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 9 of 11
124. (increment c6)
   changed: (value c6) from 79 to 89
   goals met: 9 of 11
125. (decrement c5)
   changed: (value c5) from 97 to 94
   goals met: 9 of 11
126. (decrement c5)
   changed: (value c5) from 94 to 91
   goals met: 9 of 11
127. (decrement c5)
   changed: (value c5) from 91 to 88
   goals met: 10 of 11
128. (decrement c6)
   changed: (value c6) from 89 to 79
   goals met: 9 of 11
129. (decrement c6)
   changed: (value c6) from 79 to 69
   goals met: 9 of 11
130. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 9 of 11
131. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 9 of 11
132. (decrement c5)
   changed: (value c5) from 88 to 83
   goals met: 9 of 11
133. (decrement c5)
   changed: (value c5) from 83 to 78
   goals met: 9 of 11
134. (decrement c5)
   changed: (value c5) from 78 to 73
   goals met: 9 of 11
135. (decrement c5)
   changed: (value c5) from 73 to 68
   goals met: 10 of 11
136. (decrement c6)
   changed: (value c6) from 69 to 59
   goals met: 9 of 11
137. (decrement c6)
   changed: (value c6) from 59 to 49
   goals met: 10 of 11
138. (decrement c5)
   changed: (value c5) from 68 to 63
   goals met: 10 of 11
139. (decrement c5)
   changed: (value c5) from 63 to 58
   goals met: 10 of 11
140. (decrement c5)
   changed: (value c5) from 58 to 53
   goals met: 10 of 11
141. (decrement c5)
   changed: (value c5) from 53 to 48
   goals met: 11 of 11
